import { describe, it, expect } from "vitest";

import * as utf_16le from "./utf-16le.js";

describe("UTF-16", () => {
  describe("encode", () => {
    it("correctly encodes sample inputs", () => {
      // python3 -c 'print("يولد جميع البشر أحرارًا ومتساوون في الكرامة والحقوق، وقد وهبوا عقلاً وضميرًا وعليهم أن يعاملوا بعضهم بعض بروح الإخاء." .encode("utf-16be").hex())'
      expect(
        utf_16le.encode(
          "يولد جميع البشر أحرارًا ومتساوون في الكرامة والحقوق، وقد وهبوا عقلاً وضميرًا وعليهم أن يعاملوا بعضهم بعض بروح الإخاء.",
        ),
      ).toEqual(
        Uint8Array.fromHex(
          "4a06480644062f0620002c0645064a063906200027064406280634063106200023062d063106270631064b0627062000480645062a0633062706480648064606200041064a062000270644064306310627064506290620004806270644062d064206480642060c062000480642062f06200048064706280648062706200039064206440627064b0620004806360645064a0631064b06270620004806390644064a064706450620002306460620004a06390627064506440648062706200028063906360647064506200028063906360620002806310648062d0620002706440625062e06270621062e00",
        ),
      );
    });
  });

  describe("survives roundtrip conversion", () => {
    it("sample input", () => {
      const input =
        "يولد جميع البشر أحرارًا ومتساوون في الكرامة والحقوق، وقد وهبوا عقلاً وضميرًا وعليهم أن يعاملوا بعضهم بعض بروح الإخاء.";

      expect(utf_16le.decode(utf_16le.encode(input))).toEqual(input);
      expect(
        utf_16le.decode(utf_16le.encode(input, { addBOM: true }), {
          stripBOM: true,
        }),
      ).toEqual(input);
    });
  });
});
