import { describe, it, expect } from "vitest";

import * as utf_16be from "./utf-16be.js";

describe("UTF-16", () => {
  describe("encode", () => {
    it("correctly encodes sample inputs", () => {
      // python3 -c 'print("يولد جميع البشر أحرارًا ومتساوون في الكرامة والحقوق، وقد وهبوا عقلاً وضميرًا وعليهم أن يعاملوا بعضهم بعض بروح الإخاء." .encode("utf-16be").hex())'
      expect(
        utf_16be.encode(
          "يولد جميع البشر أحرارًا ومتساوون في الكرامة والحقوق، وقد وهبوا عقلاً وضميرًا وعليهم أن يعاملوا بعضهم بعض بروح الإخاء.",
        ),
      ).toEqual(
        Uint8Array.fromHex(
          "064a06480644062f0020062c0645064a063900200627064406280634063100200623062d063106270631064b0627002006480645062a0633062706480648064600200641064a002006270644064306310627064506290020064806270644062d064206480642060c002006480642062f00200648064706280648062700200639064206440627064b0020064806360645064a0631064b06270020064806390644064a064706450020062306460020064a06390627064506440648062700200628063906360647064500200628063906360020062806310648062d0020062706440625062e06270621002e",
        ),
      );
    });
  });

  describe("survives roundtrip conversion", () => {
    it("sample input", () => {
      const input =
        "يولد جميع البشر أحرارًا ومتساوون في الكرامة والحقوق، وقد وهبوا عقلاً وضميرًا وعليهم أن يعاملوا بعضهم بعض بروح الإخاء.";

      expect(utf_16be.decode(utf_16be.encode(input))).toEqual(input);
      expect(
        utf_16be.decode(utf_16be.encode(input, { addBOM: true }), {
          stripBOM: true,
        }),
      ).toEqual(input);
    });
  });
});
